Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelSelectedEntityGuids(System.String,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetOverlayModelHiddenEntityGuids(System.String,System.Collections.Generic.List{System.String}@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Int32,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t@,Tekla.Structures.Model.Internal.IProgressReportCallback)
DO NOT USE! For internal usage only!
aOutPath:
aBasePointGuid:
aBasePointExportType:
aExportType:
aPropertiesPath:
selectedOnly:
info:
progressCb:

Tekla.Structures.ModelInternal.ICDelegate.StartLiveSharing(Tekla.Structures.Model.Internal.IChangeSetCreatedCallback)


Tekla.Structures.ModelInternal.ICDelegate.StopLiveSharing


Tekla.Structures.ModelInternal.ICDelegate.CreateBaseline(System.String)


Tekla.Structures.ModelInternal.ICDelegate.GetPendingChangeSets(System.String)
